ebay/ebay-connector/ebay-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/requests/ebay/api_getMyeBaySelling_optional.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ebl="urn:ebay:apis:eBLBaseComponents">
   <soapenv:Header>
      <ebl:RequesterCredentials>
         <!--Optional:-->
         <ebl:eBayAuthToken>%s(authToken)</ebl:eBayAuthToken>
      </ebl:RequesterCredentials>
   </soapenv:Header>
   <soapenv:Body>
      <ebl:GetMyeBaySellingRequest>
		<ebl:ActiveList>
			<ebl:Include>true</ebl:Include>
		</ebl:ActiveList>
		<ebl:SoldList>
			<ebl:Include>true</ebl:Include>
		</ebl:SoldList>
		<ebl:Version>%s(version)</ebl:Version>
		<ebl:ErrorLanguage>en_US</ebl:ErrorLanguage>
      </ebl:GetMyeBaySellingRequest>
   </soapenv:Body>
</soapenv:Envelope>